package by.epam.training.module2;
/*Сортировка вставками. Дана последовательность чисел a 1 , a 2 , ... , a n . 
Требуется переставить числа в порядке возрастания.Делается это следующим образом. 
Пусть a 1 , a 2 , ... , a i - упорядоченная последовательность, т. е. a 1 <= a 2 <= ... <= a n . 
Берется следующее число a i + 1 и вставляется в последовательность так, чтобы новая           *
последовательность была тоже возрастающей. Процесс производится до тех пор, пока все 
элементы от i +1 до n не будут перебраны. Примечание. Место помещения очередного элемента в отсортированную часть производить с помощью *
 двоичного поиска. Двоичный поиск оформить в виде отдельной функции. */

public class Task31 {
	
	public static void main(String[] args) {
		

	}

}
